Catalogs/РегистрацияВИФНС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>РегистрацияВИФНС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Comment>Код причины постановки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеИФНС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представитель</Name>
					<Comment>Представитель в территориальном органе ФНС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПредставителя</Name>
					<Comment>Название документа, подтверждающего полномочия представителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УполномоченноеЛицоПредставителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доверенность</Name>
					<Comment>Доверенность налогоплательщика на представителя</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоверенностиНалогоплательщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/РегистрацияВИФНС/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка ИЛИ ЭтотОбъект.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоПБОЮЛ = РегламентированнаяОтчетность.ЭтоПБОЮЛ(Владелец);
	
	Если ПустаяСтрока(Код) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не задан код налогового органа.", Отказ);
	ИначеЕсли СтрДлина(СокрЛП(Код)) <> 4 Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Код налогового органа должен состоять из 4 символов.", Отказ);
	КонецЕсли;
	
	Если НЕ ЭтоПБОЮЛ Тогда
		Если ПустаяСтрока(КПП) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Не заполнен КПП.", Отказ);
		ИначеЕсли СтрДлина(СокрЛП(КПП)) <> 9 Тогда
			ОбщегоНазначения.СообщитьОбОшибке("КПП должен состоять из 9 символов.", Отказ);
		КонецЕсли;
	Иначе
		КПП = ""; // Для ПБОЮЛ не предусмотрен
	КонецЕсли;
	
	СуществующаяЗапись = РегламентированнаяОтчетность.ПолучитьПоКодамРегистрациюВИФНС(Владелец, Код, КПП);
	
	Если СуществующаяЗапись <> Неопределено И СуществующаяЗапись <> Ссылка Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Для данной организации уже существует запись с указанными кодом налогового органа" 
		+ ?(ЭтоПБОЮЛ, ".", " и КПП."), Отказ);
	КонецЕсли;
	
	Если ПустаяСтрока(НаименованиеИФНС) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не заполнено полное наименование налогового органа.", Отказ);
	Конецесли;
	
	Если ЗначениеЗаполнено(Представитель) И ПустаяСтрока(ДокументПредставителя) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не задан документ, подтверждающий полномочия представителя.", Отказ);
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		Если ПустаяСтрока(Наименование) Тогда
			Наименование = НаименованиеИФНС;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Представитель) Тогда
			ДокументПредставителя = "";
			УполномоченноеЛицоПредставителя = "";
		ИначеЕсли Метаданные.Справочники.Найти("ФизическиеЛица") <> Неопределено И ТипЗнч(Представитель) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			УполномоченноеЛицоПредставителя = "";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
